Repository: 84000/data-translation-memory
Catalog: toh68_84000-ascertaining-the-vinaya-upali-s-questions.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བ་རྣམས་ཀྱིས་ནི་སྲོག་གི་ཕྱིར་ཡང་བསླབ་པ་ཡོངས་སུ་མི་གཏོང་ངོ་། །ཞེས་གསུངས་ལགས་ན། བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སམ་བཞུགས་ཀྱང་རུང་སྟེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་སོ་སོར་ཐར་པའི་སྡོམ་པ་ནི་ཇི་ལྟར་བརྗོད་པར་བགྱི།
en: The Bhagavān has also taught that followers of the Bodhisattva­yāna do not abandon their training even for the sake of their lives. How then would a bhagavān, one who has either passed into parinirvāṇa or still remains, explain the prātimokṣa vows of the followers of the Śrāvakayāna?

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་སོ་སོར་ཐར་པའི་སྡོམ་པ་ནི་ཇི་ལྟར་བརྗོད་པར་བགྱི།
en: How would the prātimokṣa vows of the followers of the Pratyekabuddhayāna be explained?

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སོ་སོར་ཐར་པའི་སྡོམ་པ་ནི་ཇི་ལྟར་བརྗོད་པར་བགྱི།
en: How would the prātimokṣa vows of bodhisattvas who follow the Mahāyāna be explained?

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ནི་འདུལ་བ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ལགས་པར་བཀའ་སྩལ་ན།
en: The Bhagavān has said that I am supreme among those who uphold the Vinaya.

source: ཅི་ནས་ཀྱང་བདག་གིས་བཅོམ་ལྡན་འདས་ལས་འདུལ་བ་ལ་མཁས་པ་མངོན་སུམ་དུ་ཐོས་ཤིང་མངོན་སུམ་དུ་བཟུང་ནས་མི་འཇིགས་པ་ཐོབ་ཅིང་འཁོར་རྣམས་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པར་འགྱུར་བ་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་དུ་གསོལ་བར་བགྱི་ལགས་སོ་སྙམ་སྟེ།
en: I will certainly listen closely to the Bhagavān’s expertise in the Vinaya and, having mastered it precisely, will gain fearlessness and teach it perfectly and in detail to the assemblies. Therefore, I thought to ask the Bhagavān to teach me perfectly and in detail.

source: བཅོམ་ལྡན་འདས་བདག་གཅིག་པུ་དབེན་པར་མཆིས་ནས་ནང་དུ་ཡང་དག་པར་བཞག་པ་ན། སེམས་ལ་བདག་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་མཆིས་ལ་འདུལ་བ་རྣམ་པར་གཏན་ལ་དབབ་པ་ཡོངས་སུ་ཞུའོ་སྙམ་པ་དེ་ལྟ་བུའི་ཡོངས་སུ་རྟོག་པ་སྐྱེས་པར་གྱུར་ལགས་ན་དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་དགེ་སློང་གི་འཁོར་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་འདུས་པ་ལ་འདུལ་བ་རྣམ་པར་གཏན་ལ་དབབ་པ་རྒྱ་ཆེར་ལེགས་པར་བསྟན་དུ་གསོལ།
en: “Bhagavān, while I was alone in private meditative seclusion, I thought, ‘I should go before the Tathāgata and request a detailed explanation of the Vinaya.’ Since this thought came to mind, Bhagavān, I ask the Tathāgata to offer a clear, thorough, and detailed explanation of the Vinaya to this great assembly of monks and bodhisattvas.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Bhagavān responded to the venerable Upāli, “Upāli, you should say that the training of the followers of the Śrāvakayāna is pure in terms of its distinctive application and distinctive orientation.

source: །ཉེ་བར་འཁོར་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་སྦྱོར་བ་གཞན་དང་། ལྷག་པའི་བསམ་པ་གཞན་གྱིས་ཡོངས་སུ་དག་པ་ཡིན་པར་སྨྲོས་ཤིག །ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ཡང་སྦྱོར་བ་གཞན་དང་ལྷག་པའི་བསམ་པ་ཡང་གཞན་གྱིས་ཡོངས་སུ་དག་པ་ཡིན་པར་སྨྲོས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: You should also say that the training of bodhisattvas who follow the Mahāyāna is pure in terms of its distinctive application and distinctive orientation.

source: ཉེ་བར་འཁོར་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་སྦྱོར་བ་ཡང་གཞན། ལྷག་པའི་བསམ་པ་ཡང་གཞན་ལ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱོར་བ་ཡང་གཞན། ལྷག་པའི་བསམ་པ་ཡང་གཞན་ཡིན་པའི་ཕྱིར་རོ།
en: Upāli, it is because the followers of the Śrāvakayāna have a distinctive application and orientation, while bodhisattvas who follow the Mahāyāna have another distinctive application and orientation.

source: །ཉེ་བར་འཁོར་དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་གང་ཡིན་པ་དེ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་དག་པ་ཉིད་དང་། ཤིན་ཏུ་འཆལ་བའི་ཚུལ་ཁྲིམས་ཉིད་ཡིན་ལ།
en: “Upāli, the pure ethical discipline of the followers of the Śrāvakayāna is impure ethical discipline for bodhisattvas who follow the Mahāyāna; for the latter it is highly corrupt ethical discipline.

source: ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་དག་པ་ཉིད་དང་། ཤིན་ཏུ་འཆལ་པའི་ཚུལ་ཁྲིམས་ཉིད་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: The pure ethical discipline of bodhisattvas who follow the Mahāyāna is impure ethical discipline for the followers of the Śrāvakayāna; for the latter it is highly corrupt ethical discipline.

source: ཉེ་བར་འཁོར་འདི་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ནི་དེའི་སྐད་ཅིག་ཙམ་ཡང་སྲིད་པར་སྐྱེ་བ་ལེན་པར་མི་བྱེད་དོ།
en: Upāli, it is because the followers of the Śrāvakayāna do not even have the fleeting desire to take rebirth in the world.

source: །དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཉིད་ཡིན་ལ། དེ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་དག་པ་ཉིད་དང་། ཤིན་ཏུ་འཆལ་པའི་ཚུལ་ཁྲིམས་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: This is pure ethical discipline for the followers of the Śrāvakayāna but is impure, highly corrupt ethical discipline for bodhisattvas who follow the Mahāyāna.

source: །ཉེ་བར་འཁོར་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་དག་པ་ཉིད་དང་། ཤིན་ཏུ་འཆལ་བའི་ཚུལ་ཁྲིམས་ཉིད་དུ་འགྱུར་བ་གང་ཞེ་ན།
en: Upāli, why is it that pure ethical discipline of bodhisattvas who follow the Mahāyāna is impure, highly corrupt ethical discipline for the followers of the Śrāvakayāna?

source: ཉེ་བར་འཁོར་འདི་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པར་སྲིད་པར་སྐྱེ་བ་ལེན་ཀྱང་སེམས་ཡོངས་སུ་མི་སྐྱོ་ཞིང་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ་དེ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་ཉིད་ཡིན་ལ།
en: Upāli, it is because bodhisattvas who follow the Mahāyāna take rebirth in saṃsāra for countless eons without aversion or weariness.

source: དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་དག་པ་ཉིད་དང་། ཤིན་ཏུ་འཆལ་པའི་ཚུལ་ཁྲིམས་ཉིད་ཡིན་ནོ།
en: This is pure ethical discipline for bodhisattvas who follow the Mahāyāna but is impure, highly corrupt ethical discipline for the followers of the Śrāvakayāna.

source: །ཉེ་བར་འཁོར་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་རྗེས་སུ་སྲུང་བ་དང་བཅས་པ་ཡིན་པར་སྨྲོས་ཤིག །ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་རྗེས་སུ་སྲུང་བ་མེད་པ་ཡིན་པར་སྨྲོས་ཤིག །ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་བཅོས་སུ་ཡོད་པ་ཡིན་པར་སྨྲོས་ཤིག །ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་བཅོས་སུ་མེད་པ་ཡིན་པར་སྨྲོས་ཤིག །ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་རིང་དུ་རྗེས་སུ་ཞུགས་པ་ཡིན་པར་སྨྲོས་ཤིག །ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་མཐར་ཆགས་པ་ཡིན་པར་སྨྲོས་ཤིག །ཉེ་བར་འཁོར་དེ་ལ་ཇི་ལྟར་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་རྗེས་སུ་སྲུང་བ་དང་བཅས་པ་ཡིན་ལ།
en: “Upāli, you should therefore say that the training of bodhisattvas who follow the Mahāyāna guards and that the training of the followers of the Śrāvakayāna does not guard. You should say that the training of bodhisattvas who follow the Mahāyāna serves as a remedy and that the training of those who follow the Śrāvakayāna does not serve as a remedy. You should say that the training of bodhisattvas who follow the Mahāyāna is pursued over a long duration and that the training of the followers of the Śrāvakayāna proceeds in stages.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་རྗེས་སུ་སྲུང་བ་མེད་པ་ཡིན་ཞེ་ན།
en: “Upāli, why is it that the training of bodhisattvas who follow the Mahāyāna guards, while the training of the followers of the Śrāvakayāna does not guard?

source: ཉེ་བར་འཁོར་འདི་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་དག་གི་སེམས་ཀྱི་རྗེས་སུ་འཇུག་པར་བྱ་དགོས་ལ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ལ་ནི་མི་དགོས་ཏེ།
en: Upāli, bodhisattvas who follow the Mahāyāna should work with the minds of other beings and other people, while the followers of the Śrāvakayāna do not need to.

source: ཉེ་བར་འཁོར་རྣམ་གྲངས་དེས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་རྗེས་སུ་སྲུང་བ་དང་བཅས་པ་ཡིན་ལ།
en: Upāli, that is why the training of bodhisattvas who follow the Mahāyāna guards, while the training of the followers of the Śrāvakayāna does not guard.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་རྗེས་སུ་སྲུང་བ་མེད་པ་ཡིན་ནོ། །ཉེ་བར་འཁོར་ཇི་ལྟར་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་བཅོས་སུ་ཡོད་པ་ཡིན་ལ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་བཅོས་སུ་མེད་པ་ཡིན་ཞེ་ན།
en: “Upāli, why is it that the training of bodhisattvas who follow the Mahāyāna serves as a remedy, while the training of the followers of the Śrāvakayāna does not serve as a remedy?

source: ཉེ་བར་འཁོར་འདི་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གལ་ཏེ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། ཉེས་པ་བྱུང་ལ་གུང་ཚིགས་ཀྱི་དུས་ཀྱི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བས་གནས་པར་བྱེད་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མ་གཏུགས་པ་ཁོ་ན་ཡིན་ནོ།
en: Upāli, if a bodhisattva who follows the Mahāyāna commits a fault in the morning and does not part from the omniscient mind at midday, then the complement of ethical discipline of the bodhisattva who follows the Mahāyāna is not at all inhibited.

source: །གལ་ཏེ་གུང་ཚིགས་ཀྱི་དུས་ཀྱི་ཚེ་ན་ཉེས་པ་བྱུང་ལ་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བས་གནས་པར་བྱེད་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མ་གཏུགས་པ་ཁོ་ན་ཡིན་ནོ།
en: If the bodhisattva commits a fault at midday and has not parted from, but rather maintains, the omniscient mind in the afternoon, then the complement of ethical discipline of the bodhisattva who follows the Mahāyāna is not at all inhibited.

source: །གལ་ཏེ་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་ན་ཉེས་པ་བྱུང་ལ་མཚན་མོའི་ཐུན་དང་པོ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བས་གནས་པར་བྱེད་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མ་གཏུགས་པ་ཁོ་ན་ཡིན་ནོ།
en: If the bodhisattva commits a fault in the afternoon and has not parted from, but rather maintains, the omniscient mind in the first watch of the night, then the complement of ethical discipline of the bodhisattva who follows the Mahāyāna is not at all inhibited.

source: །གལ་ཏེ་མཚན་མོའི་ཐུན་དང་པོ་ལ་ཉེས་པ་བྱུང་ལ་མཚན་མོའི་གུང་ཐུན་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བས་གནས་པར་བྱེད་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མ་གཏུགས་པ་ཁོ་ན་ཡིན་ནོ།
en: If the bodhisattva commits a fault in the first watch of the night and has not parted from, but rather maintains, the omniscient mind in the middle watch of the night, then the complement of ethical discipline of the bodhisattva who follows the Mahāyāna is not at all inhibited.

source: །གལ་ཏེ་མཚན་མོའི་གུང་ཐུན་ལ་ཉེས་པ་བྱུང་ལ་མཚན་མོའི་ཐུན་ཐ་མ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བས་གནས་པར་བྱེད་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་མ་གཏུགས་པ་ཁོ་ན་ཡིན་ནོ།
en: If the bodhisattva commits a fault in the middle watch of the night and has not parted from, but rather maintains, the omniscient mind in the last watch of the night, then the complement of ethical discipline of the bodhisattvas who follow the Mahāyāna is not at all inhibited.

source: །ཉེ་བར་འཁོར་དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་བཅོས་སུ་ཡོད་པ་ཡིན་ཏེ།
en: Therefore, Upāli, the training of bodhisattvas who follow the Mahāyāna serves as a remedy.

source: དེ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔས་འགྱོད་པའི་ཀུན་ནས་ལྡང་བ་ཧ་ཅང་བསྐྱེད་པར་མི་བྱ་ཞིང་ཧ་ཅང་ཡིད་ལ་གཅགས་པར་ཡང་མི་བྱའོ།
en: Bodhisattvas should neither give rise to excess remorse for nor feel overly dejected about their faults.

source: །ཉེ་བར་འཁོར་དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ཡང་དང་ཡང་དུ་ཉེས་པ་བྱུང་ན་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་ཉམས་པ་དང་། རབ་ཏུ་ཉམས་པ་དང་། ཡོངས་སུ་གཏུགས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: “Upāli, you should understand that when the followers of the Śrāvakayāna commit a fault repeatedly, the complement of ethical discipline of those followers of the Śrāvakayāna deteriorates, degenerates, and is exhausted. Why?

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཉན་ཐོས་ཀྱི་ཐེག་པ་པས་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་མགོ་དང་གོས་ལ་མེ་འབར་བ་ལྟ་བུར་བྱ་དགོས་པའི་ཕྱིར་ཏེ།
en: Because followers of the Śrāvakayāna, for the sake of eliminating all afflictions, act as if their head and clothes were on fire.

source: དེ་ལྟར་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འདོད་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་བཅོས་སུ་མེད་པ་ཡིན་ནོ།
en: In this way, the training of the followers of the Śrāvakayāna—who fervently desire parinirvāṇa—does not serve as a remedy.

source: །ཉེ་བར་འཁོར་ཇི་ལྟར་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་རིང་དུ་རྗེས་སུ་ཞུགས་པ་ཡིན་ལ།
en: “Upāli, how is it that the training of bodhisattvas who follow the Mahāyāna is pursued over a long duration, while the training of the Śrāvakayāna proceeds in stages?

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་མཐར་ཆགས་པ་ཡིན་ཞེ་ན། ཉེ་བར་འཁོར་འདི་ལ་གལ་ཏེ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་དག་གིས་རྩེ་བ་དང་། དགའ་བ་དང་། དགའ་མགུར་སྤྱད་པ་བྱས་ཀྱང་བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཡོངས་སུ་མ་གཏུགས་པ་ཁོ་ན་ཡིན་པར་རིག་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Upāli, you should understand that even if bodhisattvas who follow the Mahāyāna revel in, relish, and enjoy the five sense pleasures for as many eons as there are grains of sand in the river Ganges but do not give up the mind of awakening, then the training of bodhisattvas who follow the Mahāyāna will not be inhibited at all. Why?

source: ཉེ་བར་འཁོར་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཉིད་ཀྱིས་ལེགས་པར་ཡོངས་སུ་ཟིན་པ་ནི་རྨི་ལམ་ན་ཡང་ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཀུན་ཏུ་རེག་པར་མི་འགྱུར་བའི་དུས་ཀྱང་ཡོད།
en: Because, Upāli, there are times and instances in which bodhisattvas who follow the Mahāyāna have so fully assimilated bodhicitta that they are not even affected by the afflictions in their dreams.

source: སྐབས་ཀྱང་ཡོད་པར་འགྱུར་བ་དང་། ཉེ་བར་འཁོར་ཡང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྲིད་པ་གཅིག་གིས་ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་མི་བྱ་སྟེ།
en: Upāli, bodhisattvas who follow the Mahāyāna do not eliminate the afflictions in a single lifetime;

source: བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་དག་ནི་རིམ་གྱིས་ཟད་པར་འགྱུར་བ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་མ་སྨིན་པ་མགོ་དང་གོས་ལ་མེ་འབར་བ་ལྟ་བུར་བྱེད་པས་ནི་དེའི་སྐད་ཅིག་ཙམ་ཡང་སྲིད་པར་སྐྱེ་བ་བསྐྱེད་པར་མི་བྱ་བའི་ཕྱིར་ཏེ།
en: the afflictions of bodhisattvas whose roots of virtue have matured are exhausted gradually. Followers of the Śrāvakayāna, whose roots of virtue have not matured and who act as if their head and clothes were on fire, will not take rebirth in saṃsāra for even an instant.

source: ཉེ་བར་འཁོར་དེ་ལྟར་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་རིང་དུ་རྗེས་སུ་ཞུགས་པ་ཡིན་ལ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་མཐར་ཆགས་པ་ཡིན་ནོ།
en: Therefore, Upāli, the training of bodhisattvas who follow the Mahāyāna is to be pursued over a long duration, and the training of the followers of the Śrāvakayāna proceeds in stages.

source: །ཉེ་བར་འཁོར་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་ནི་རྗེས་སུ་སྲུང་བ་དང་བཅས་པ་དང་། བཅོས་སུ་ཡོད་པ་དང་། རིང་དུ་རྗེས་སུ་ཞུགས་པ་ཡིན་པར་སྨྲོས་ཤིག །ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་བསླབ་པ་ནི་རྗེས་སུ་སྲུང་བ་མེད་པ་དང་། བཅོས་སུ་མེད་པ་དང་། མཐར་ཆགས་པ་ཡིན་པར་སྨྲོས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Therefore, Upāli, you should say that the training of bodhisattvas who follow the Mahāyāna guards, serves as a remedy, and is pursued over a long duration. You should say that the training of the followers of the Śrāvakayāna does not guard, does not serve as a remedy, and proceeds in stages.

source: ཉེ་བར་འཁོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཚོགས་ཆེན་པོ་དང་ལྡན་པ་ཡིན་པས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ཏུ་སྐྱོ་བས་ནི་བསྐལ་པ་ཚད་མེད་གྲངས་མེད་པར་ཡང་མཚམས་སྦྱོར་ཞིང་འཁོར་བར་སླ་བ་མ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Upāli, unsurpassed, completely perfect awakening requires significant requisites; it is not easy for bodhisattvas who follow the Mahāyāna to take rebirth and transmigrate for limitless eons if they are singularly discontented with saṃsāra.

source: ཉེ་བར་འཁོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་དོན་གྱི་དབང་དེ་གཟིགས་པས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གཅིག་ཏུ་སྐྱོ་བའི་གཏམ་མི་གསུང་། གཅིག་ཏུ་འདོད་ཆགས་དང་བྲལ་བའི་གཏམ་མི་གསུང་།
en: “Upāli, the tathāgata, arhat, completely perfect buddhas recognize that there is a purpose in not teaching bodhisattvas engaged in the Mahāyāna about discontentment alone, or in teaching them about dispassion alone or only about revulsion.

source: གཅིག་ཏུ་ཡིད་འབྱུང་བའི་གཏམ་མི་གསུང་བར་དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་དང་ལྡན་པའི་གཏམ་གསུང་ངོ་། །ཟབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པ་དང་། ཕྲ་བ་དང་། བརྟགས་པ་དང་། འགྱོད་པ་མེད་པ་དང་། ཀུན་ནས་ལྡང་བ་མེད་པའི་གཏམ་གསུང་ངོ་།
en: They also teach on being joyful and delighted, on what is profound and what is not defiled, about subtleties, analysis, and about being without regret and obsession.

source: །ཐོགས་པ་མེད་པ་དང་། སྒྲིབ་པ་མེད་པ་དང་། སྟོང་པ་ཉིད་ཀྱི་གཏམ་གསུང་སྟེ།
en: They teach about what is unobstructed, about what is unobscured, and about emptiness.

source: དེ་དག་གི་གཏམ་དེ་དག་ཐོས་ནས་མངོན་པར་དགའ་ཞིང་འཁོར་བས་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཆགས་པ་མེད་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Hearing these teachings, bodhisattvas are overjoyed, do not feel discontent for saṃsāra, and perfect nonattachment, the unsurpassed, completely perfect state of awakening.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ནོངས་པ་གང་ལགས་པ་དེ་དག་ལས་ཁ་ཅིག་ནི་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པ་ལགས། ཁ་ཅིག་ནི་ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པ་ལགས། ཁ་ཅིག་ནི་གཏི་མུག་དང་མཚུངས་པར་ལྡན་པ་ལགས་ན།
en: Then the venerable Upāli asked the Bhagavān, “Bhagavān, among the things considered to be errors, some are associated with desire, some are associated with anger, and some are associated with delusion.

source: བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཅི་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པ་འམ། འོན་ཏེ་ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པའམ། འོན་ཏེ་གཏི་མུག་དང་མཚུངས་པར་ལྡན་པའམ། གང་ཞིག་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ནོངས་པ་ཤིན་ཏུ་ལྕི་བར་འགྱུར་བ་ལགས།
en: That being so, Bhagavān, which of those are the weightiest errors for bodhisattvas who follow the Mahāyāna—those associated with desire, those associated with anger, or those associated with delusion?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཉེ་བར་འཁོར་གལ་ཏེ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་བྱུང་བར་གྱུར་ལ།
en: The Bhagavān replied to the venerable Upāli, “Upāli, suppose that, on the one hand, a bodhisattva who follows the Mahāyāna commits faults associated with desire for as many eons as there are grains of sand in the river Ganges;

source: ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་གང་ཡིན་པ་ནི་གཅིག་ཅིག་བྱུང་བར་གྱུར་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཚད་མར་བྱས་ན་ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་གང་ཡིན་པ་དེ་ནི་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་དེ་དག་པས་ཆེས་ཉེས་པ་ལྕི་བར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: and suppose that, on the other hand, the same bodhisattva commits a single fault related to anger. If we consider each of these cases in the context of the Bodhisattva­yāna, then the fault related to anger is much weightier than the faults related to desire.

source: ཉེ་བར་འཁོར་ཞེ་སྡང་ནི་སེམས་ཅན་ཡོངས་སུ་གཏོང་བར་འགྱུར་བ་ཡིན་ལ། འདོད་ཆགས་ནི་སེམས་ཅན་སྡུད་པར་འགྱུར་བ་ཡིན་ཏེ།
en: Upāli, anger forsakes beings, whereas desire brings beings together.

source: ཉེ་བར་འཁོར་དེ་ལ་སེམས་ཅན་སྡུད་པར་འགྱུར་བའི་ཉོན་མོངས་པ་གང་ཡིན་པ་དེ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྒྱུ་བག་དང་འཇིགས་པ་མེད་ལ།
en: Upāli, bodhisattvas are not deceived by and do not fear afflictions that gather beings together;

source: སེམས་ཅན་ཡོངས་སུ་གཏོང་བར་འགྱུར་བའི་ཉོན་མོངས་པ་གང་ཡིན་པ་དེ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྒྱུ་བག་དང་འཇིགས་པ་ཡོད་པའི་ཕྱིར་རོ།
en: but bodhisattvas are deceived by and fear the afflictions that forsake beings.

source: །ཉེ་བར་འཁོར་ཡང་དེ་བཞིན་གཤེགས་པས་འདོད་ཆགས་ནི་འབྲལ་བ་བུལ་ལ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆུང་བ་དང་། ཞེ་སྡང་ནི་འབྲལ་བ་མྱུར་ལ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆེ་བ་དང་། གཏི་མུག་ནི་འབྲལ་བ་བུལ་ལ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆེ་བར་གསུངས་པ་གང་ཡིན་པ་དེ་ལ།
en: “Moreover, Upāli, the Tathāgata has taught that desire is a minor misdeed that is given up slowly, anger is a major misdeed that is given up quickly, and delusion is a major misdeed that is given up slowly.

source: ཉེ་བར་འཁོར་འབྲལ་བ་བུལ་ལ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆུང་བ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཉོན་མོངས་པ་མ་ཡིན་པར་བལྟའོ།
en: Among those, Upāli, minor misdeeds that are given up slowly are not considered afflictions for bodhisattvas.

source: །འབྲལ་བ་མྱུར་ལ་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་ཆེ་བ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཉོན་མོངས་པ་ཡིན་པས་རྨི་ལམ་ན་ཡང་འདོད་པར་མི་བྱའོ།
en: Major misdeeds that are given up quickly should be viewed as afflictions for bodhisattvas; indeed, they should not desire them, even in their dreams.

source: །ཉེ་བར་འཁོར་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་གང་དག་ཡིན་པ་དེ་དག་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྒྱུ་བག་དང་ཉེས་པ་མེད་པས་དེ་དག་ཐམས་ཅད་ནི་ཉེས་པ་མ་ཡིན་པར་སྨྲོས་ཤིག །ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་གང་དག་ཡིན་པ་དེ་དག་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྒྱུ་བག་དང་ཉེས་པ་ཡོད་པས་དེ་དག་ཐམས་ཅད་ནི་ཉེས་པ་ཡིན་པར་སྨྲོས་ཤིག །ཉེ་བར་འཁོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཐབས་ལ་མི་མཁས་པ་དེ་དག་ནི་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་དག་གིས་འཇིགས་པར་བྱེད་ལ།
en: Therefore, Upāli, you should say that the faults of bodhisattvas that are associated with desire are not faults, because for bodhisattvas there is no deception or fault in them. You should say that faults associated with anger are faults, because for bodhisattvas there is deception and fault in them. Upāli, those bodhisattvas who are not skilled in means are frightened by the faults associated with desire but are not frightened by the faults associated with anger.

source: ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པ་དག་གིས་ནི་འཇིགས་པར་མི་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཐབས་ལ་མཁས་པ་དེ་དག་ནི་ཞེ་སྡང་དང་མཚུངས་པར་ལྡན་པའི་ཉེས་པ་དག་གིས་འཇིགས་པར་བྱེད་ལ་འདོད་ཆགས་དང་མཚུངས་པར་ལྡན་པ་དག་གིས་ནི་འཇིགས་པར་མི་བྱེད་དོ།
en: Bodhisattvas who are skilled in means are frightened by the faults associated with anger but are not frightened by the faults associated with desire.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ། འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤིན་ཏུ་དུལ་བའི་ཆོས་ཐམས་ཅད་ལ་འདུལ་བ་ཅི་ཞིག་མཆིས།
en: Then Youthful Mañjuśrī, who was in the assembly, said to the Bhagavān, “Bhagavān, what is discipline when all phenomena are thoroughly tamed?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་གལ་ཏེ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དུལ་བར་ཤེས་ན་ནི་དེ་བཞིན་གཤེགས་པ་ཡང་ཡང་དང་ཡང་དུ་འདུལ་བ་འཆའ་བར་མི་མཛད་པ་ཞིག་ན།
en: The Bhagavān replied to Youthful Mañjuśrī, “Mañjuśrī, if foolish beings knew that all phenomena are thoroughly tamed, then the Tathāgata would not have to formulate the Vinaya over and over.

source: གང་གི་ཕྱིར་སེམས་ཅན་རྣམས་ཀྱིས་མི་ཤེས་པ་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡང་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་དུལ་བ་རྟོགས་པར་བྱ་བའི་ཕྱིར་རིམ་གྱིས་བྱ་བའི་འདུལ་བ་འཆའ་བར་མཛད་དོ།
en: Because beings do not know this, the Tathāgata gradually formulated the Vinaya so that they may understand that all phenomena are thoroughly tamed.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་འདུལ་བ་རྣམ་པར་གཏན་ལ་དབབ་པ་བསྟན་པ་བཤད་པ་འདི་ལ་ཅི་ཡང་མི་སྟོན་ལགས་ན།
en: Then the venerable Upāli said to the Bhagavān, “Bhagavān, Youthful Mañjuśrī has not offered any kind of explanation on the instructions for ascertaining the Vinaya.
